app/controllers/chirps_controller.rb

SELECT "chirps".* FROM "chirps" WHERE "chirps"."author_id" = $1  [["author_id", 2]]
---
    def index
        # user = User.includes(:chirps).find_by(id: params[:user_id])
        chirps = Chirp.where(author_id: params[:user_id])

SELECT  "chirps".* FROM "chirps" WHERE "chirps"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def show
        chirp = Chirp.find_by(id: params[:id])