app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def show
        # the key of the wildcard in params, aka :id here, is however the wildcard appears in rails routes
        @user = User.find(params[:id]) #find errors out if the id is not found

INSERT INTO "users" ("username", "email", "age", "political_affiliation") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "snoop"], ["email", "snoop@aa.io"], ["age", 35], ["political_affiliation", "ruby"]]
---
    def create
        # debugger
        # User.new(
        #     username: params[:username],
        #     email: params[:email],
        #     age: params[:age],
        #     political_affiliation: params[:political_affiliation]
        # )
        # user = User.new(params[:user])


        @user = User.new(user_params)

        # if user.save!  this is throw an error and stop code execution when it fails
        if @user.save # this will return false if it fails

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "age" = $2, "political_affiliation" = $3 WHERE "users"."id" = $4  [["username", "Jedi"], ["age", 5000], ["political_affiliation", "The"], ["id", 17]]
---
    def update
        user = User.find_by(id: params[:id]) #find_by returns nil when not found
        if user.update(user_params)