app/controllers/users_controller.rb

UPDATE "users" SET "username" = $1 WHERE "users"."id" = $2  [["username", "boop"], ["id", 15]]
---
    def update
        user = User.find_by(id: params[:id]) #find_by returns nil when not found
        if user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 16]]
---
    def destroy
        user = User.find_by(id: params[:id])
        user.destroy