app/models/user.rb

    def self.find_by_credentials(username, password)
        # debugger
        user = User.find_by(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "si_hikes"], ["LIMIT", 1]]

    def reset_session_token!
        # debugger
        self.session_token = SecureRandom::urlsafe_base64
        self.save!
---
UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "isNoNYU4m6MlWSN6uNgVJw"], ["id", 13]]